# vim: syntax=ruby filetype=ruby

# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
#
# To install from this file:
#   $ brew tap homebrew/bundle
#   $ brew bundle

# Make sure using latest Homebrew:
#   $ brew update

# Update already-installed brews:
#   $ brew upgrade

tap 'caskroom/cask'
tap 'homebrew/versions'

brew 'coreutils'

# Shell utilities
brew 'fpp'
brew 'fzf'
brew 'the_silver_searcher'
brew 'trash'
brew 'tree'
brew 'z'

# Vim
brew 'vim'
brew 'zplug'

# Tmux
brew 'reattach-to-user-namespace'
brew 'tmux'

# Git
brew 'diff-so-fancy'
brew 'git'

# Node
# TODO: setup script to install nvm and latest node
brew 'yarn'

# Ruby
brew 'chruby'
brew 'ruby-install'
brew 'ruby'

# Python
brew 'python'

# MySQL
brew 'mysql'

# Apps
# TODO: separate apps for home computer in different file?
# cask 'air-video-server-hd'
# cask 'backblaze'
# cask 'doxie'
#
# TODO: buy dash4 license >_>
# cask 'dash'

cask 'alfred'
cask 'anki'
cask 'atom'
cask 'bartender'
cask 'charles'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'keepingyouawake'
cask 'sketch'
cask 'spectacle'
