# vim: syntax=ruby filetype=ruby

# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
#
# To install from this file:
#   $ brew tap homebrew/bundle
#   $ brew bundle
#
# Make sure using latest Homebrew:
#   $ brew update
#
# Update already-installed brews:
#   $ brew upgrade
#
# Update already-installed casks:
#   $ brew cu

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap "homebrew/versions"
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'buo/cask-upgrade'

brew 'coreutils'

# Shell utilities
brew 'fpp'
brew 'fzf'
brew 'the_silver_searcher'
brew 'trash'
brew 'tree'
brew 'z'

# Vim
brew 'vim'
brew 'zplug'

# Tmux
brew 'reattach-to-user-namespace'
brew 'tmux'

# Git
brew 'diff-so-fancy'
brew 'git'

# Node
# TODO: setup script to install nvm and latest node
brew 'yarn'

# Ruby
brew 'chruby'
brew 'ruby-install'
brew 'ruby'

# Python
brew 'python'

# MySQL
brew 'mysql'

# Apps
# TODO: separate apps for home computer in different file?
# cask 'air-video-server-hd'
# cask 'backblaze'
# cask 'doxie'
# cask 'transmission'

cask 'alfred'
cask 'anki'
cask 'atom'
cask 'bartender'
cask 'charles'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'hazel'
cask 'istat-menus'
cask 'iterm2'
cask 'keepingyouawake'
cask 'licecap'
cask 'marked'
cask 'plug'
cask 'sketch'
cask 'spectacle'
cask 'spotify'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

# Mac App Store Apps
mas "1Password", id: 443987910
mas "DaisyDisk", id: 411643860
mas "Go2Shell", id: 445770608
mas "Microsoft Remote Desktop", id: 715768417
mas "Pocket", id: 568494494
mas "Sip", id: 507257563
mas "Slack", id: 803453959
mas "Tweetbot", id: 557168941
mas "Wunderlist", id: 410628904
