# vim: syntax=ruby filetype=ruby

# https://robots.thoughtbot.com/brewfile-a-gemfile-but-for-homebrew
#
# To install from this file:
#   $ brew tap homebrew/bundle
#   $ brew bundle
#
# Make sure using latest Homebrew:
#   $ brew update
#
# Update already-installed brews:
#   $ brew upgrade
#
# Update already-installed casks:
#   $ brew cu

tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade'

brew 'coreutils'

# Shell utilities
brew 'asciinema'
brew 'bat'
brew 'cheat'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'fpp'
brew 'fx'
brew 'htop'
brew 'ripgrep'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'zplug'

# Vim
brew 'neovim'
brew 'vim', args: ["HEAD"]

# Tmux
brew 'reattach-to-user-namespace'
brew 'tmux'

# Git
brew 'diff-so-fancy'
brew 'git'
brew 'tig'

# Node
brew 'yarn', args: ["ignore-dependencies"]

# Ruby
brew 'chruby'
brew 'ruby-install'
brew 'ruby'

# Python
brew 'python'

# MySQL
brew 'mysql'

# CLI for Mac App Store
brew 'mas'

# Apps
cask '1password'
cask 'aerial'
cask 'alfred'
cask 'anki'
cask 'atom'
cask 'bartender'
cask 'charles'
cask 'dash'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'hazel'
cask 'istat-menus'
cask 'karabiner-elements'
cask 'keepingyouawake'
cask 'kitty'
cask 'licecap'
cask 'marked'
cask 'postman'
cask 'rocket'
cask 'sketch'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-fira-code'

# Mac App Store Apps
mas 'DaisyDisk', id: 411643860
mas 'Icon Slate', id: 439697913
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Noizio', id: 928871589
mas 'Pocket', id: 568494494
mas 'Sip', id: 507257563
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835
